I agree with your hesitation for sure. OK, so I think I figured out why it would work for you and not me.

I update my code to create the IAM role in the same account, whereas before I was using a role in another account and it now works as expected. So the conditions for this issue are specifying `resources` AND using a principal in a different account. Bizarre.

Do you think it's worth updating the documentation to cover this case specifically?

Steps to resolve with same account principal:

Code:

```hcl
provider "aws" {region = "us-east-1"}

resource "aws_iam_role" "bs_role" {
  name = "some_bs_role"
    assume_role_policy = jsonencode({
    Version = "2012-10-17"
    Statement = [
      {
        Action = "sts:AssumeRole"
        Effect = "Allow"
        Sid    = ""
        Principal = {
          Service = "ec2.amazonaws.com"
        }
      },
    ]
  })
}

data "aws_iam_policy_document" "some_queue_role_policy" {
  statement {
    sid    = "CatalogServiceSQSRolePolicy"
    effect = "Allow"
    actions = [
      "sqs:GetQueueAttributes",
      "sqs:ListQueues",
      "sqs:ReceiveMessage",
      "sqs:ChangeMessageVisibility",
      "sqs:DeleteMessage",
      "sqs:GetQueueUrl",
      "sqs:SendMessage",
    ]
    resources = [
      aws_sqs_queue.some_queue.arn
    ]
    principals {
      type        = "AWS"
      identifiers = [aws_iam_role.bs_role.arn]
    }
  }
}

resource "aws_sqs_queue" "some_queue" {
  name                       = "some-queue"
  message_retention_seconds  = 86400
  visibility_timeout_seconds = 60
  sqs_managed_sse_enabled    = true
}

resource "aws_sqs_queue_policy" "some_queue_policy" {
  policy    = data.aws_iam_policy_document.some_queue_role_policy.json
  queue_url = aws_sqs_queue.some_queue.id
}
```

Logs:

```log
❯ tf apply -auto-approve   

Terraform used the selected providers to generate the following execution plan. Resource actions are indicated with the following symbols:
  + create
 <= read (data resources)

Terraform will perform the following actions:

  # data.aws_iam_policy_document.some_queue_role_policy will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "some_queue_role_policy" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions   = [
              + "sqs:ChangeMessageVisibility",
              + "sqs:DeleteMessage",
              + "sqs:GetQueueAttributes",
              + "sqs:GetQueueUrl",
              + "sqs:ListQueues",
              + "sqs:ReceiveMessage",
              + "sqs:SendMessage",
            ]
          + effect    = "Allow"
          + resources = [
              + (known after apply),
            ]
          + sid       = "CatalogServiceSQSRolePolicy"

          + principals {
              + identifiers = [
                  + (known after apply),
                ]
              + type        = "AWS"
            }
        }
    }

  # aws_iam_role.bs_role will be created
  + resource "aws_iam_role" "bs_role" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "ec2.amazonaws.com"
                        }
                      + Sid       = ""
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "some_bs_role"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = (known after apply)
      + unique_id             = (known after apply)

      + inline_policy (known after apply)
    }

  # aws_sqs_queue.some_queue will be created
  + resource "aws_sqs_queue" "some_queue" {
      + arn                               = (known after apply)
      + content_based_deduplication       = false
      + deduplication_scope               = (known after apply)
      + delay_seconds                     = 0
      + fifo_queue                        = false
      + fifo_throughput_limit             = (known after apply)
      + id                                = (known after apply)
      + kms_data_key_reuse_period_seconds = 0
      + max_message_size                  = 262144
      + message_retention_seconds         = 86400
      + name                              = "some-queue"
      + name_prefix                       = (known after apply)
      + policy                            = (known after apply)
      + receive_wait_time_seconds         = 0
      + redrive_allow_policy              = (known after apply)
      + redrive_policy                    = (known after apply)
      + sqs_managed_sse_enabled           = true
      + tags_all                          = (known after apply)
      + url                               = (known after apply)
      + visibility_timeout_seconds        = 60
    }

  # aws_sqs_queue_policy.some_queue_policy will be created
  + resource "aws_sqs_queue_policy" "some_queue_policy" {
      + id        = (known after apply)
      + policy    = (known after apply)
      + queue_url = (known after apply)
    }

Plan: 3 to add, 0 to change, 0 to destroy.
aws_iam_role.bs_role: Creating...
aws_sqs_queue.some_queue: Creating...
aws_iam_role.bs_role: Creation complete after 1s [id=some_bs_role]
aws_sqs_queue.some_queue: Still creating... [10s elapsed]
aws_sqs_queue.some_queue: Still creating... [20s elapsed]
aws_sqs_queue.some_queue: Creation complete after 27s [id=https://sqs.us-east-1.amazonaws.com/<account id>/some-queue]
data.aws_iam_policy_document.some_queue_role_policy: Reading...
data.aws_iam_policy_document.some_queue_role_policy: Read complete after 0s [id=2078477688]
aws_sqs_queue_policy.some_queue_policy: Creating...
aws_sqs_queue_policy.some_queue_policy: Still creating... [10s elapsed]
aws_sqs_queue_policy.some_queue_policy: Still creating... [20s elapsed]
aws_sqs_queue_policy.some_queue_policy: Creation complete after 25s [id=https://sqs.us-east-1.amazonaws.com/<account id>/some-queue]

Apply complete! Resources: 3 added, 0 changed, 0 destroyed.
```
